/*
! 1. shift() => შლის მასივვის პირველ ელემენტს
! 2. unshift() => ამატებს პირველ ელემენტს
! 3. pop() => შლის ბოლო ელემენტს
! 4. push() => ამატებს მასივის ბოლო ელემენტს

! 5. join() => მასივი გადაჰყავს სტრიქონიში და შეგიძლია დაამატო ნებისმიერი
! ინფორმაცია, მათ სორის სასვენი ნიშნები
! 6. include() => აერთიანებს მასივებს
! 7.concat () => აერთიანებს მასივებს 
! 8.reverse () => ათვლას იწყებს ბოლო მასივიდან
! 9.slice () => გამოაქვს კონკ მითითებული ინფორმაცია
!დასაწყებად ინდექსი და დასასრული ინდექსი
! 10.splice () =>
    !1 შლის ელემენტებს 
    !2 შლის და ამატებს   
    !3 მხოლოდ ამატებს
*/


const symbols = ['🖕', '🙏', '👊', '💋', '💤']

console.log(symbols)

const del_element = symbols.shift()

const add_element = symbols.unshift('🤞')

console.log(symbols)